#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.external_secrets_irsa_role.data.aws_iam_policy_document.external_secrets[0]: Reading...
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
data.aws_iam_policy_document.aws_lbc: Reading...
module.karpenter.data.aws_region.current: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
aws_iam_policy.eks_admin: Refreshing state... [id=arn:aws:iam::944101542130:policy/AmazonEKSAdminPolicy]
module.external_secrets_irsa_role.data.aws_iam_policy_document.external_secrets[0]: Read complete after 0s [id=2831063531]
module.karpenter.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.aws_lbc: Read complete after 0s [id=819195744]
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.external_secrets_irsa_role.data.aws_caller_identity.current: Reading...
module.external_secrets_irsa_role.data.aws_region.current: Reading...
aws_iam_policy.external_secrets: Refreshing state... [id=arn:aws:iam::944101542130:policy/external-secrets-policy]
data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.external_secrets_irsa_role.data.aws_partition.current: Reading...
module.external_secrets_irsa_role.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.external_secrets_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Reading...
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_iam_user.manager: Refreshing state... [id=manager]
module.karpenter.data.aws_caller_identity.current: Reading...
module.user1_iam_user.aws_iam_user.this[0]: Refreshing state... [id=user1]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=944101542130]
module.eks_admins_iam_group.data.aws_partition.current: Reading...
module.eks_admins_iam_group.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.allow_eks_access_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/allow-eks-access]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/cluster-dev/cluster]
module.eks_admins_iam_group.aws_iam_group.this[0]: Refreshing state... [id=eks-admin]
aws_iam_policy.aws_lbc: Refreshing state... [id=arn:aws:iam::944101542130:policy/AWSLoadBalancerController]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-07dd7513b1327c225]
module.external_secrets_irsa_role.aws_iam_policy.external_secrets[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/AmazonEKS_External_Secrets_Policy-20250629102607346200000004]
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Read complete after 1s [id=944101542130]
aws_iam_role.aws_lbc: Refreshing state... [id=dev-aws-lbc]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20250629102607294300000003]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20250629102607210300000002]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=cluster-dev-cluster-20250629102606793900000001]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
aws_iam_role_policy_attachment.aws_lbc: Refreshing state... [id=dev-aws-lbc-20250629102607852200000009]
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Reading...
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=2639324505]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/cluster-dev-cluster-20250629102607457600000005]
module.eks_admins_iam_group.aws_iam_group_membership.this[0]: Refreshing state... [id=eks-admin]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20250629102607294300000003-2025062910260787680000000a]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20250629102607294300000003-2025062910260796110000000d]
module.external_secrets_irsa_role.data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20250629102607294300000003-2025062910260796090000000c]
data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cluster-dev-cluster-20250629102606793900000001-20250629102607758300000007]
module.karpenter.data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cluster-dev-cluster-20250629102606793900000001-20250629102607767700000008]
aws_iam_role.eks_admin: Refreshing state... [id=dev-eks-admin]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=944101542130]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cluster-dev-cluster-20250629102606793900000001-2025062910260800970000000e]
data.aws_availability_zones.available: Read complete after 1s [id=ap-south-1]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::944101542130:assumed-role/github-oidc-role/aws-github-oidc]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3527639816]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=4a02a089-c7de-4fea-8aa6-41341768f5ba]
aws_iam_role_policy_attachment.eks_admin: Refreshing state... [id=dev-eks-admin-20250629102607596400000006]
aws_iam_policy.eks_assume_admin: Refreshing state... [id=arn:aws:iam::944101542130:policy/AmazonEKSAssumeAdminPolicy]
aws_iam_user_policy_attachment.manager: Refreshing state... [id=manager-2025062910260794750000000b]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cluster-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/cluster-dev-cluster-ClusterEncryption20250629102633623200000016]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cluster-dev-cluster-20250629102606793900000001-20250629102634163700000017]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0bd9cb1067d3823d2]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-03126e1b31cde8dba]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-06118a9ca3eeeb7c1]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a5f9010954d045ab]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b4dad0e325346ecc]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=1863738953]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f46ff610e080775a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08b5ad4a836cd107f]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0c188b65148b09650]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07c24a68deb607e96]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00637fb3277bb3326]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05de2b7bee90b4ac0]
module.eks_admins_iam_role.aws_iam_role.this[0]: Refreshing state... [id=eks-admin]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-098afda2f91193964]
module.eks_admins_iam_role.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-admin-20250629102623887000000013]
module.allow_assume_eks_admins_iam_policy.aws_iam_policy.policy[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/allow-assume-eks-admin-iam-role]
module.eks_admins_iam_group.aws_iam_group_policy_attachment.custom_arns[0]: Refreshing state... [id=eks-admin-20250629102624467900000014]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07510214b3abd091a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05f3f9f357758b54f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08b5ad4a836cd107f1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0528819b79544c4a8]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1220549072]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-3157736952]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2464039527]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1528250598]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-409509399]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2877748888]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1536959985]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-744565275]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1989158486]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2918393103]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1734941533]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01ff2ac67ebdc50dc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08476646ff19d902e]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0658da03dafc14e27]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-098afda2f911939641080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster-dev]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0722dd0bad9bafd30,Environment]
module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"]: Refreshing state... [id=sg-0722dd0bad9bafd30,Owner]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0722dd0bad9bafd30,Project]
module.eks.aws_ec2_tag.cluster_primary_security_group["terraform"]: Refreshing state... [id=sg-0722dd0bad9bafd30,terraform]
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-06-29T10:41:24Z]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cluster-dev:arn:aws:iam::944101542130:role/github-oidc-role]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.aws_eks_access_entry.this["example"]: Refreshing state... [id=cluster-dev:arn:aws:iam::944101542130:root]
module.eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8331855912967736402]
module.eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-008316d811140d3b5]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=2efe2bc0b862928b4aefe315c4a10c4ad5223ff5]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::944101542130:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/1B9ABDE35523875F967ED9B67C5186CF]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.external_secrets_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_secrets_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3702528852]
module.external_secrets_irsa_role.aws_iam_role.this[0]: Refreshing state... [id=external-secrets-irsa]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cluster-dev#arn:aws:iam::944101542130:role/github-oidc-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["example_example"]: Refreshing state... [id=cluster-dev#arn:aws:iam::944101542130:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 1s [id=eks-pod-identity-agent]
module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=cluster-dev:karpenter-20250629104132774500000012]
module.external_secrets_irsa_role.aws_iam_role_policy_attachment.this["policy"]: Refreshing state... [id=external-secrets-irsa-20250629104055545800000002]
module.external_secrets_irsa_role.aws_iam_role_policy_attachment.external_secrets[0]: Refreshing state... [id=external-secrets-irsa-20250629104055511700000001]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=cluster-dev:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=cluster-dev:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=cluster-dev:kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=cluster-dev:vpc-cni]
data.aws_eks_cluster_auth.default: Reading...
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-7wmv1vwjdaz8dcti5]
aws_eks_pod_identity_association.aws_lbc: Refreshing state... [id=a-gbgw56oobvdhnhivs]
aws_eks_access_entry.manager: Refreshing state... [id=cluster-dev:arn:aws:iam::944101542130:role/dev-eks-admin]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-cluster-dev-20250629104056957600000004]
data.aws_eks_cluster_auth.default: Read complete after 0s [id=cluster-dev]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/944101542130/Karpenter-cluster-dev]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250629104056957700000005]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250629104056955100000003]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250629104056963700000007]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250629104056959200000006]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=Karpenter-cluster-dev-20250629104056957600000004-2025062910405804200000000d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=Karpenter-cluster-dev-20250629104056957600000004-2025062910405786960000000b]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=Karpenter-cluster-dev-20250629104056957600000004-2025062910405795390000000c]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=Karpenter-cluster-dev-20250629104056957600000004-2025062910405779300000000a]
helm_release.updater: Refreshing state... [id=updater]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2789825699]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/944101542130/Karpenter-cluster-dev]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=1927392482]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=2940113252]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=2940113252]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/KarpenterController-20250629104126107000000010]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20250629102607210300000002-20250629104126284200000011]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=cluster-dev:arn:aws:iam::944101542130:role/Karpenter-cluster-dev-20250629104056957600000004]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20250629104056957700000005-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20250629104056963700000007-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20250629104056959200000006-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20250629104056955100000003-KarpenterInterruptionQueueTarget]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                global:
                  image:
                    tag: "v2.12.6"
                
                server:
                  extraArgs:
                    - --insecure
            EOT,
        ]
      + verify                     = false
      + version                    = "3.35.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.aws_lbc will be created
  + resource "helm_release" "aws_lbc" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.9.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "cluster-dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-07dd7513b1327c225"
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.external_nginx will be created
  + resource "helm_release" "external_nginx" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external"
      + namespace                  = "ingress"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                controller:
                  ingressClassResource:
                    name: external-nginx
                  service:
                    annotations:
                      service.beta.kubernetes.io/aws-load-balancer-type: external
                      service.beta.kubernetes.io/aws-load-balancer-nlb-target-type: ip
                      service.beta.kubernetes.io/aws-load-balancer-scheme: internet-facing
            EOT,
        ]
      + verify                     = false
      + version                    = "4.10.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                replicaCount: 1
                
                installCRDs: true
                
                webhook:
                  port: 10250
            EOT,
        ]
      + verify                     = false
      + version                    = "0.16.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                serviceAccount:
                  name: karpenter
                settings:
                  clusterName: cluster-dev
                  clusterEndpoint: https://1B9ABDE35523875F967ED9B67C5186CF.gr7.ap-south-1.eks.amazonaws.com
                  interruptionQueue: Karpenter-cluster-dev
                tolerations:
                  - key: CriticalAddonsOnly
                    operator: Exists
                  - key: eks.amazonaws.com/compute-type
                    operator: Equal
                    value: fargate
                    effect: NoSchedule
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.6"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                defaultArgs:
                  - --cert-dir=/tmp
                  - --kubelet-preferred-address-types=InternalIP,ExternalIP,Hostname
                  - --kubelet-use-node-status-port
                  - --metric-resolution=15s
                  - --secure-port=10250
            EOT,
        ]
      + verify                     = false
      + version                    = "3.12.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.reloader will be created
  + resource "helm_release" "reloader" {
      + atomic                     = false
      + chart                      = "reloader"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "reloader"
      + namespace                  = "reloader"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://stakater.github.io/stakater-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                reloader:
                  autoReloadAll: true
                  reloadOnConfigChange: true
                  reloadOnSecretChange: true
            EOT,
        ]
      + verify                     = false
      + version                    = "2.1.4"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.updater is tainted, so must be replaced
-/+ resource "helm_release" "updater" {
      ~ id                         = "updater" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v0.12.2"
              - chart          = "argocd-image-updater"
              - first_deployed = 1751194404
              - last_deployed  = 1751194404
              - name           = "updater"
              - namespace      = "argocd"
              - revision       = 1
              - values         = jsonencode(
                    {
                      - image   = {
                          - tag = "v0.12.2"
                        }
                      - metrics = {
                          - enabled = true
                        }
                    }
                )
              - version        = "0.9.1"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                       = "updater"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # kubectl_manifest.karpenter_node_class will be created
  + resource "kubectl_manifest" "karpenter_node_class" {
      + api_version             = "karpenter.k8s.aws/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1beta1
            kind: EC2NodeClass
            metadata:
              name: default
            spec:
              amiFamily: AL2023
              role: Karpenter-cluster-dev-20250629104056957600000004
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cluster-dev
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: cluster-dev
              tags:
                karpenter.sh/discovery: cluster-dev
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_pool will be created
  + resource "kubectl_manifest" "karpenter_node_pool" {
      + api_version             = "karpenter.sh/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1beta1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 1000
              template:
                spec:
                  nodeClassRef:
                    name: default
                  requirements:
                  - key: karpenter.k8s.aws/instance-category
                    operator: In
                    values:
                    - c
                    - m
                    - r
                  - key: karpenter.k8s.aws/instance-cpu
                    operator: In
                    values:
                    - "4"
                    - "8"
                    - "16"
                    - "32"
                  - key: karpenter.k8s.aws/instance-hypervisor
                    operator: In
                    values:
                    - nitro
                  - key: karpenter.k8s.aws/instance-generation
                    operator: Gt
                    values:
                    - "2"
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 10 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @durga61, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS infra creation`*